app/controllers/admin_controller.rb

SELECT count(*) AS count_all FROM "pedidos"
---
  def index
    @total_pedidos = Pedido.count