app/controllers/info_controller.rb

SELECT * FROM "produtos" WHERE ("produtos"."id" = 3)
---
  def quem_comprou
    @produto = Produto.find(params[:id])