app/controllers/loja_controller.rb

SELECT * FROM "produtos" WHERE ("produtos"."id" = 3)
---
  def adicionar_a_lista
    produto = Produto.find(params[:id])

SELECT * FROM "produtos" WHERE ("produtos"."id" = 0)
---
  def limpar_item
    @lista = encontrar_lista
    produto = Produto.find(params[:id])

INSERT INTO "pedido_items" ("id_pedido", "preco_total", "created_at", "updated_at", "quantidade", "id_produto") VALUES(2182717160, 15.0, '2010-07-16 22:42:40', '2010-07-16 22:42:40', 1, 6)
INSERT INTO "pedidos" ("endereco", "created_at", "nome", "updated_at", "tipo_de_pagamento", "email") VALUES('Rua Antonio Barreto', '2010-07-16 22:42:40', 'Olavio', '2010-07-16 22:42:40', 'banco', 'olavo@gmail.com')
---
  def checkout
    @lista = encontrar_lista
    encaminhar_index("Não há nenhum produto na sua lista de compras") if @lista.items.empty?
    if request.get?
      @pedido = Pedido.new
    else
      @pedido = Pedido.new(params[:pedido])
      @pedido.adicionar_pedido_items_da_lista(@lista)
      if @pedido.save