app/controllers/loja_controller.rb

  def salvar_pedido
    @lista = encontrar_lista
    @pedido = Pedido.new(params[:pedido])
    @pedido.adicionar_pedido_items_da_lista(@lista)
    if @pedido.save
---
INSERT INTO "pedido_items" ("id_pedido", "preco_total", "created_at", "updated_at", "quantidade", "id_produto") VALUES(2163856280, 30.0, '2010-05-28 14:48:01', '2010-05-28 14:48:01', 2, 6)
INSERT INTO "pedidos" ("endereco", "created_at", "nome", "updated_at", "tipo_de_pagamento", "email") VALUES('rua la de casa', '2010-05-24 18:48:47', 'timoteo', '2010-05-24 18:48:47', 'banco', 'tim')