app/controllers/usuarios_controller.rb

SELECT * FROM "usuarios" ORDER BY nome
---
  def index
    @usuarios = Usuario.all(:order => :nome)

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)
---
  def show
    @usuario = Usuario.find(params[:id])

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 3) LIMIT 1
---
  def edit
    @usuario = Usuario.find(params[:id])

INSERT INTO "usuarios" ("salt", "created_at", "nome", "senha_hashed", "updated_at") VALUES('21564509600.975732093782754', '2010-07-12 18:59:15', 'timoteo', '6ac226391c056ae6799dcc09e80f45378b310af8', '2010-07-12 18:59:15')
---
  def create
    @usuario = Usuario.new(params[:usuario])

    respond_to do |format|
      if @usuario.save

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 4) LIMIT 1
UPDATE "usuarios" SET "updated_at" = '2010-07-16 20:45:16', "salt" = '21823211600.743872960579137', "senha_hashed" = 'f9b8da77455f13de7e51382ff75acb8a01e28eca' WHERE "id" = 4
---
  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1) LIMIT 1
DELETE FROM "usuarios" WHERE "id" = 1
---
  def destroy
    @usuario = Usuario.find(params[:id])
    begin
      flash[:notice] = "Usuário #{@usuario.nome} apagado"
      @usuario.destroy